status/2022/0408.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>02 April 2022 - 08 April 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">02 April 2022 - 08 April 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7ff387e">1. MIT OCW</a>
<ul>
<li><a href="#org1bfa7e6">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org2e9b7f9">1.1.1. Finished Exam2</a></li>
</ul>
</li>
<li><a href="#orgc2ddc0e">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#orgf29cf04">1.2.1. Started Problem Set 2</a></li>
<li><a href="#org0b4bbe3">1.2.2. Planning experiment to measure 'g'</a></li>
</ul>
</li>
<li><a href="#org8cd4aa7">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#orgae817ca">1.3.1. Finished Episodes 25-26</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org343bd5a">2. Mill Controller #2</a>
<ul>
<li><a href="#org9474fa9">2.1. Potential for using old Compaq iPaq boards.</a></li>
<li><a href="#org6febdb9">2.2. May use OLPC in the meantime.</a></li>
<li><a href="#org8ca8047">2.3. Still having problems with mill controller booting reliably.</a></li>
</ul>
</li>
<li><a href="#orgec6f0e0">3. OLPC</a>
<ul>
<li><a href="#orgb3668a2">3.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orgdb60a49">4. Part Numbers</a></li>
<li><a href="#org9e33a7d">5. Virtual Orchestra</a></li>
<li><a href="#org007ff2e">6. Quilting Frame Desk</a>
<ul>
<li><a href="#org9cd8314">6.1. Started edge banding fitting - Special biscuits need work</a></li>
</ul>
</li>
<li><a href="#orgffcf48b">7. David Davies</a>
<ul>
<li><a href="#org1dcfd05">7.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgaa182a4">7.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org104a64f">7.3. Next hearing 4/29/2022.</a></li>
</ul>
</li>
<li><a href="#orgd968b42">8. Peter Kim</a>
<ul>
<li><a href="#org4e8ac51">8.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org285f3a6">8.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org8518063">8.3. Change of Plea Hearing set for 5/31/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7ff387e" class="outline-2">
<h2 id="org7ff387e"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1bfa7e6" class="outline-3">
<h3 id="org1bfa7e6"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org2e9b7f9" class="outline-4">
<h4 id="org2e9b7f9"><span class="section-number-4">1.1.1.</span> Finished Exam2</h4>
</div>
</div>
<div id="outline-container-orgc2ddc0e" class="outline-3">
<h3 id="orgc2ddc0e"><span class="section-number-3">1.2.</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf29cf04" class="outline-4">
<h4 id="orgf29cf04"><span class="section-number-4">1.2.1.</span> Started Problem Set 2</h4>
</div>
<div id="outline-container-org0b4bbe3" class="outline-4">
<h4 id="org0b4bbe3"><span class="section-number-4">1.2.2.</span> Planning experiment to measure 'g'</h4>
</div>
</div>
<div id="outline-container-org8cd4aa7" class="outline-3">
<h3 id="org8cd4aa7"><span class="section-number-3">1.3.</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgae817ca" class="outline-4">
<h4 id="orgae817ca"><span class="section-number-4">1.3.1.</span> Finished Episodes 25-26</h4>
</div>
</div>
</div>
<div id="outline-container-org343bd5a" class="outline-2">
<h2 id="org343bd5a"><span class="section-number-2">2.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9474fa9" class="outline-3">
<h3 id="org9474fa9"><span class="section-number-3">2.1.</span> Potential for using old Compaq iPaq boards.</h3>
</div>
<div id="outline-container-org6febdb9" class="outline-3">
<h3 id="org6febdb9"><span class="section-number-3">2.2.</span> May use OLPC in the meantime.</h3>
</div>
<div id="outline-container-org8ca8047" class="outline-3">
<h3 id="org8ca8047"><span class="section-number-3">2.3.</span> Still having problems with mill controller booting reliably.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Needs a new RTC battery.
</p>
</div>
</div>
</div>
<div id="outline-container-orgec6f0e0" class="outline-2">
<h2 id="orgec6f0e0"><span class="section-number-2">3.</span> OLPC</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb3668a2" class="outline-3">
<h3 id="orgb3668a2"><span class="section-number-3">3.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orgdb60a49" class="outline-2">
<h2 id="orgdb60a49"><span class="section-number-2">4.</span> Part Numbers</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="http://www.tryton.org/">http://www.tryton.org/</a> ? Probably overkill.
</p>
</div>
</div>
<div id="outline-container-org9e33a7d" class="outline-2">
<h2 id="org9e33a7d"><span class="section-number-2">5.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-5">
<p>
Still can't decide if this is a dumb idea, but coding Ravel's Bolero
in lilypond as a start to evaluate difficulty in generating csound code
from lilypond and comparing output with fluidsynth.
</p>
</div>
</div>
<div id="outline-container-org007ff2e" class="outline-2">
<h2 id="org007ff2e"><span class="section-number-2">6.</span> Quilting Frame Desk</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org9cd8314" class="outline-3">
<h3 id="org9cd8314"><span class="section-number-3">6.1.</span> Started edge banding fitting - Special biscuits need work</h3>
</div>
</div>
<div id="outline-container-orgffcf48b" class="outline-2">
<h2 id="orgffcf48b"><span class="section-number-2">7.</span> David Davies</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org1dcfd05" class="outline-3">
<h3 id="org1dcfd05"><span class="section-number-3">7.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgaa182a4" class="outline-3">
<h3 id="orgaa182a4"><span class="section-number-3">7.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org104a64f" class="outline-3">
<h3 id="org104a64f"><span class="section-number-3">7.3.</span> Next hearing 4/29/2022.</h3>
</div>
</div>
<div id="outline-container-orgd968b42" class="outline-2">
<h2 id="orgd968b42"><span class="section-number-2">8.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org4e8ac51" class="outline-3">
<h3 id="org4e8ac51"><span class="section-number-3">8.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org285f3a6" class="outline-3">
<h3 id="org285f3a6"><span class="section-number-3">8.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org8518063" class="outline-3">
<h3 id="org8518063"><span class="section-number-3">8.3.</span> Change of Plea Hearing set for 5/31/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>